In [1]:
import pandas as pd
import numpy as np
from warnings import warn
import dask.dataframe as dd
pd.set_option('display.max_columns', None) 
pd.set_option('display.max_rows', None)
pd.set_option('display.float_format', '{:.2f}'.format)

In [2]:
global df_title_basics, df_title_ratings, df_tmdb # crear variables globales

Dataset title basics

In [3]:
with open(r'C:\Users\Chamo\Desktop\Python\mis_paquetes\Proyecto_movie\title.basics.tsv', 'r') as f:
    for i in range(3):                 # esta delimitado por tabulaciones.
        print(f.readline())

tconst	titleType	primaryTitle	originalTitle	isAdult	startYear	endYear	runtimeMinutes	genres

tt0000001	short	Carmencita	Carmencita	0	1894	\N	1	Documentary,Short

tt0000002	short	Le clown et ses chiens	Le clown et ses chiens	0	1892	\N	5	Animation,Short

In [4]:
# ABRIR ARCHIVO TITLE BASICS
df_title_basics = dd.read_csv(r'C:\Users\Chamo\Desktop\Python\mis_paquetes\Proyecto_movie\title.basics.tsv'\
    ,dtype={'isAdult': 'object', 'runtimeMinutes': 'object','startYear': 'object'},na_values=['\\N'] ,delimiter='\t', low_memory=False)

In [6]:
df_title_basics.head(10)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0,1894,NaN,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,NaN,5,"Animation,Short"
2,tt0000003,short,Pauvre Pierrot,Pauvre Pierrot,0,1892,NaN,5,"Animation,Comedy,Romance"
3,tt0000004,short,Un bon bock,Un bon bock,0,1892,NaN,12,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893,NaN,1,"Comedy,Short"
5,tt0000006,short,Chinese Opium Den,Chinese Opium Den,0,1894,NaN,1,Short
6,tt0000007,short,Corbett and Courtney Before the Kinetograph,Corbett and Courtney Before the Kinetograph,0,1894,NaN,1,"Short,Sport"
7,tt0000008,short,Edison Kinetoscopic Record of a Sneeze,Edison Kinetoscopic Record of a Sneeze,0,1894,NaN,1,"Documentary,Short"
8,tt0000009,movie,Miss Jerry,Miss Jerry,0,1894,NaN,45,Romance
9,tt0000010,short,Leaving the Factory,La sortie de l'usine Lumière à Lyon,0,1895,NaN,1,"Documentary,Short"

In [7]:
df_title_basics = df_title_basics.drop(['endYear', 'isAdult'], axis=1)

In [8]:
df_title_basics.head()

,tconst,titleType,primaryTitle,originalTitle,startYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,1894,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,1892,5,"Animation,Short"
2,tt0000003,short,Pauvre Pierrot,Pauvre Pierrot,1892,5,"Animation,Comedy,Romance"
3,tt0000004,short,Un bon bock,Un bon bock,1892,12,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,1893,1,"Comedy,Short"

In [9]:
df_title_basics.shape[0].compute()  # 10M

10826336

In [10]:
df_title_basics = df_title_basics[df_title_basics["titleType"].isin(['tvSeries', 'movie'])]

In [28]:
df_title_basics.head()

,tconst,titleType,primaryTitle,originalTitle,startYear,runtimeMinutes,genres
8,tt0000009,movie,Miss Jerry,Miss Jerry,1894,45,Romance
144,tt0000147,movie,The Corbett-Fitzsimmons Fight,The Corbett-Fitzsimmons Fight,1897,100,"Documentary,News,Sport"
570,tt0000574,movie,The Story of the Kelly Gang,The Story of the Kelly Gang,1906,70,"Action,Adventure,Biography"
587,tt0000591,movie,The Prodigal Son,L'enfant prodigue,1907,90,Drama
672,tt0000679,movie,The Fairylogue and Radio-Plays,The Fairylogue and Radio-Plays,1908,120,"Adventure,Fantasy"

In [11]:
df_title_basics['titleType'].value_counts().compute() # Comprovando si solo existen los dos valores requeridos.

titleType
tvSeries    264506
movie       682734
Name: count, dtype: int64

In [12]:
df_title_basics.shape[0].compute() # antes tenia 10M de datos, ahora solo 947 mill, quedandome con los valores de movie y tvSerie

947240

In [20]:
df_title_basics = df_title_basics.compute()

In [21]:
type(df_title_basics)

pandas.core.frame.DataFrame

In [24]:
df_title_basics[df_title_basics['tconst']== 'tt0000591'] #comprovar veracidad de datos en pagina IMDB (comprove 5 de ellos con exito los 5)

,tconst,titleType,primaryTitle,originalTitle,startYear,runtimeMinutes,genres
587,tt0000591,movie,The Prodigal Son,L'enfant prodigue,1907,90,Drama

In [25]:
df_title_basics.info()

<class 'pandas.core.frame.DataFrame'>
Index: 947240 entries, 8 to 783039
Data columns (total 7 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   tconst          947240 non-null  object
 1   titleType       947240 non-null  object
 2   primaryTitle    947238 non-null  object
 3   originalTitle   947238 non-null  object
 4   startYear       826447 non-null  object
 5   runtimeMinutes  530393 non-null  object
 6   genres          851080 non-null  object
dtypes: object(7)
memory usage: 57.8+ MB

In [26]:
 #Eliminar valores NaN
df_title_basics = df_title_basics.dropna()

In [27]:
df_title_basics.info()   # Cada columna queda con 492k valores.

<class 'pandas.core.frame.DataFrame'>
Index: 492629 entries, 8 to 783039
Data columns (total 7 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   tconst          492629 non-null  object
 1   titleType       492629 non-null  object
 2   primaryTitle    492629 non-null  object
 3   originalTitle   492629 non-null  object
 4   startYear       492629 non-null  object
 5   runtimeMinutes  492629 non-null  object
 6   genres          492629 non-null  object
dtypes: object(7)
memory usage: 30.1+ MB

In [30]:
df_title_basics['titleType'].value_counts()

titleType
movie       397365
tvSeries     95264
Name: count, dtype: int64

In [31]:
df_title_basics.shape[0] # de 947k vajo a 49k

492629

In [32]:
df_title_basics.tail(10)

,tconst,titleType,primaryTitle,originalTitle,startYear,runtimeMinutes,genres
782778,tt9916206,tvSeries,Nojor,Nojor,2019,20,Fantasy
782783,tt9916216,tvSeries,Kalyanam Mudhal Kadhal Varai,Kalyanam Mudhal Kadhal Varai,2014,22,Romance
782810,tt9916270,movie,Il talento del calabrone,Il talento del calabrone,2020,84,Thriller
782855,tt9916362,movie,Coven,Akelarre,2020,92,"Drama,History"
782864,tt9916380,tvSeries,Meie aasta Aafrikas,Meie aasta Aafrikas,2019,43,"Adventure,Comedy,Family"
782939,tt9916538,movie,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,2019,123,Drama
782980,tt9916622,movie,Rodolpho Teóphilo - O Legado de um Pioneiro,Rodolpho Teóphilo - O Legado de um Pioneiro,2015,57,Documentary
783007,tt9916680,movie,De la ilusión al desconcierto: cine colombiano...,De la ilusión al desconcierto: cine colombiano...,2007,100,Documentary
783029,tt9916730,movie,6 Gunn,6 Gunn,2017,116,Drama
783039,tt9916754,movie,Chico Albuquerque - Revelações,Chico Albuquerque - Revelações,2013,49,Documentary

In [33]:
# Eliminar  datos duplicados
df_title_basics = df_title_basics.drop_duplicates(subset=['tconst'])

In [35]:
df_title_basics['titleType'].value_counts()

titleType
movie       397365
tvSeries     95264
Name: count, dtype: int64

In [36]:
print(df_title_basics.dtypes)

tconst            object
titleType         object
primaryTitle      object
originalTitle     object
startYear         object
runtimeMinutes    object
genres            object
dtype: object

In [37]:
df_title_basics.shape[0]

492629

In [38]:
# Combertir la columna star year a tiempo y run time a entero.
df_title_basics = df_title_basics.astype({
    'startYear':'datetime64[ns]',
    'runtimeMinutes': int
    })

In [40]:
print(df_title_basics.dtypes)

tconst                    object
titleType                 object
primaryTitle              object
originalTitle             object
startYear         datetime64[ns]
runtimeMinutes             int32
genres                    object
dtype: object

Paso 3: Inspeccionar los atributos

In [41]:
df_title_basics.head()

,tconst,titleType,primaryTitle,originalTitle,startYear,runtimeMinutes,genres
8,tt0000009,movie,Miss Jerry,Miss Jerry,1894-01-01,45,Romance
144,tt0000147,movie,The Corbett-Fitzsimmons Fight,The Corbett-Fitzsimmons Fight,1897-01-01,100,"Documentary,News,Sport"
570,tt0000574,movie,The Story of the Kelly Gang,The Story of the Kelly Gang,1906-01-01,70,"Action,Adventure,Biography"
587,tt0000591,movie,The Prodigal Son,L'enfant prodigue,1907-01-01,90,Drama
672,tt0000679,movie,The Fairylogue and Radio-Plays,The Fairylogue and Radio-Plays,1908-01-01,120,"Adventure,Fantasy"

In [42]:
df_title_basics.describe()

                           startYear  runtimeMinutes
count                         492629       492629.00
mean   1998-03-18 11:24:49.673567488           81.47
min              1894-01-01 00:00:00            1.00
25%              1985-01-01 00:00:00           60.00
50%              2009-01-01 00:00:00           84.00
75%              2017-01-01 00:00:00           98.00
max              2029-01-01 00:00:00        51420.00
std                              NaN          118.06

In [43]:
df_title_basics.info()

<class 'pandas.core.frame.DataFrame'>
Index: 492629 entries, 8 to 783039
Data columns (total 7 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   tconst          492629 non-null  object
 1   titleType       492629 non-null  object
 2   primaryTitle    492629 non-null  object
 3   originalTitle   492629 non-null  object
 4   startYear       492629 non-null  datetime64[ns]
 5   runtimeMinutes  492629 non-null  int32
 6   genres          492629 non-null  object
dtypes: datetime64[ns](1), int32(1), object(5)
memory usage: 28.2+ MB

In [44]:
df_title_basics['titleType'].value_counts()

titleType
movie       397365
tvSeries     95264
Name: count, dtype: int64

In [45]:
rows_with_nan = df_title_basics.isna().any(axis=1).sum() # verificar si tiene columnas con NaN 
print(rows_with_nan)

0

In [145]:
print(df_title_basics.dtypes)

tconst                    object
titleType                 object
primaryTitle              object
originalTitle             object
isAdult                   object
startYear         datetime64[ns]
runtimeMinutes             int32
genres                    object
dtype: object

In [47]:
# guardandolo como archivo csv
df_title_basics.to_csv('C:/Users/Chamo/Documents/title_basics_procesado1.csv', index=False, sep='\t')